package Text_clustering

import "testing"

func BenchmarkTextArrClustering(b *testing.B) {
	testStrArr := []string{"2022年长三角数学建模竞赛", "浙江省第十九届大学生程序设计竞赛", "大创省级立项", "浙江省计算机设计大赛省一", "2022年第二届长三角数学建模竞赛一等奖", "第二届长三角高校数学建模竞赛 SPSSPRO创新应用奖", "浙江省spsspro创新应用奖", "长三角数学建模竞赛二等奖", "杭电第23届数学建模竞赛", "大学生创业竞赛 省级立项", "浙江省大学生物理（理论）创新竞赛", "第二届长三角高校数学建模竞赛", "第十三届中国大学生服务外包创新创业企业命题类（A类）", "认证杯数学建模竞赛", "高教社杯数学建模竞赛", "2022长三角数学建模竞赛三等奖", "2022年第二届长三角高校数学建模竞赛", "互联网➕", "长三角数学建模", "长三角数学建模竞赛", "2022蓝桥杯浙江省一等奖", "浙江省计算机设计大赛一等奖", "浙江省计算机设计大赛省一", "第十二届浙江省大学生物理实验与科技创新竞赛", "服务外包大赛区域赛三等奖", "长三角数模竞赛", "长三角数学建模竞赛", "全国大学生数学竞赛", "浙江省计算机设计大赛", "2022年浙江省第十九届大学生程序设计竞赛", "第二届长三角高校数学建模竞赛\t"}
	for n := 0; n < b.N; n++ {
		TextArrClustering(testStrArr) // run fib(30) b.N times
	}
}
